app/Models/UsersModel.php

    public function getByCouriersAll(): array{
        $db      = \Config\Database::connect();
        $builder = $db->table('couriers');
        $query   = $builder->get();
---
SELECT *
FROM `couriers`

    public function getByCourier($id){
      $db      = \Config\Database::connect();
      $builder = $db->table('couriers');
      $query   = $builder->getWhere(['id'=>$id]);
---
SELECT *
FROM `couriers`
WHERE `id` = '31'